DanielMilutinovic/monic/monic firmware/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v6.0
processor: MIMXRT1011xxxxx
package_id: MIMXRT1011DAE5A
mcu_data: ksdk2_0
processor_version: 6.0.0
board: MIMXRT1010-EVK
pin_labels:
- {pin_num: '3', pin_signal: GPIO_09, label: GPIO1_09, identifier: UART1_RXD;GPIO1_09;SiLab_RX;GATE_56_02}
- {pin_num: '2', pin_signal: GPIO_10, label: 'LPUART1_TXD/J56[4]', identifier: UART1_TXD;RST_56_04;DATA_56_04}
- {pin_num: '65', pin_signal: GPIO_SD_10, label: 'FlexSPI_CLK_A/U13[6]', identifier: FlexSPI_CLK;GPIO2_10}
- {pin_num: '66', pin_signal: GPIO_SD_09, label: 'FlexSPI_D0_A/U13[5]', identifier: FlexSPI_D0_A;GPIO2_09}
- {pin_num: '68', pin_signal: GPIO_SD_07, label: 'FlexSPI_D1_A/U13[2]', identifier: FlexSPI_D1_A;GPIO2_07}
- {pin_num: '67', pin_signal: GPIO_SD_08, label: 'FlexSPI_D2_A/U13[3]', identifier: FlexSPI_D2_A;GPIO2_08}
- {pin_num: '64', pin_signal: GPIO_SD_11, label: 'FlexSPI_D3_A/U13[7]', identifier: FlexSPI_D3_A;GPIO2_11}
- {pin_num: '69', pin_signal: GPIO_SD_06, label: 'FlexSPI_SS0/U13[1]', identifier: FlexSPI_SS0;GPIO2_06}
- {pin_num: '1', pin_signal: GPIO_11, label: GPIO_11, identifier: GPIO_11;LED_TEST}
- {pin_num: '11', pin_signal: GPIO_02, label: 'I2C1_SCL/U10[17]/J57[20]/U26[4]', identifier: I2C1_SCL;LED_57_20;D1_57_20}
- {pin_num: '12', pin_signal: GPIO_01, label: 'I2C1_SDA/U10[18]/J57[18]/U26[6]', identifier: I2C1_SDA;LED_57_18;D0;D0_57_18}
- {pin_num: '10', pin_signal: GPIO_03, label: 'SAI1_RXD0/U10[16]', identifier: SAI1_RXD0;GPIO1_03}
- {pin_num: '9', pin_signal: GPIO_04, label: 'SAI1_TXD0/U10[14]', identifier: SAI1_TXD0;GPIO1_04}
- {pin_num: '8', pin_signal: GPIO_05, label: SAI1_TXD1, identifier: SAI1_TXD1;GPIO1_05}
- {pin_num: '6', pin_signal: GPIO_06, label: 'SAI1_TX_BCLK/U10[12]', identifier: SAI1_TX_BCLK;GPIO_06;GPIO1_06}
- {pin_num: '5', pin_signal: GPIO_07, label: 'SAI1_TX_SYNC/U10[13]', identifier: SAI1_TX_SYNC;GPIO1_07}
- {pin_num: '4', pin_signal: GPIO_08, label: 'SAI1_MCLK/U10[11]', identifier: SAI1_MCLK;GPIO1_08}
- {pin_num: '59', pin_signal: GPIO_AD_01, label: 'ADC12_1/J26[10]/J56[14]', identifier: ADC12_1;LED_56_14;D2_56_14}
- {pin_num: '58', pin_signal: GPIO_AD_02, label: 'ADC12_2/J26[12]/J56[16]', identifier: ADC12_2;LED_57_16;LED_56_16;D3_56_16}
- {pin_num: '57', pin_signal: GPIO_AD_03, label: 'LPSPI1_SDI/J57[10]/U27[2]', identifier: LPSPI1_SDI;LED_57_10;D4_57_10}
- {pin_num: '56', pin_signal: GPIO_AD_04, label: 'LPSPI1_SDO/J57[8]/U27[5]', identifier: LPSPI1_SDO;LED_57_08;D5_57_08}
- {pin_num: '55', pin_signal: GPIO_AD_05, label: 'LPSPI1_PCS0/INT1_COMBO/J56[6]/J57[6]/U26[11]/U27[1]', identifier: LPSPI1_PCS0;LED_57_06;D6_57_06}
- {pin_num: '52', pin_signal: GPIO_AD_06, label: 'LPSPI1_SCK/INT2_COMBO/J56[8]/J57[12]/U26[9]/U27[6]', identifier: LPSPI1_SCK;LED_57_20;LED_57_12;D7_57_12}
- {pin_num: '51', pin_signal: GPIO_AD_07, label: 'ADC12_3/J26[2]', identifier: ADC12_3;CS_26_2}
- {pin_num: '13', pin_signal: GPIO_00, label: 'AUD_INT/U10[15]', identifier: AUD_INT;GPIO1_00}
- {pin_num: '80', pin_signal: GPIO_12, label: GPIO1_12, identifier: USB_OTG1_OC;GPIO1_12}
- {pin_num: '79', pin_signal: GPIO_13, label: GPIO1_13, identifier: USB_OTG1_ID;GPIO1_13}
- {pin_num: '60', pin_signal: GPIO_AD_00, label: USB_OTG1_PWR, identifier: USB_OTG1_PWR;GPIO1_14}
- {pin_num: '49', pin_signal: GPIO_AD_08, label: 'JTAG_TRSTB/J55[10]', identifier: JTAG_TRSTB;CD;GPIO1_22}
- {pin_num: '48', pin_signal: GPIO_AD_09, label: 'ADC12_4/JTAG_TDO/J55[6]/J26[4]', identifier: ADC12_4;WR_26_04}
- {pin_num: '47', pin_signal: GPIO_AD_10, label: 'ADC12_5/JTAG_TDI/J55[8]/J26[6]', identifier: ADC12_5;RD_26_06;GATE_26_06}
- {pin_num: '45', pin_signal: GPIO_AD_12, label: 'JTAG_TCK/J55[4]', identifier: JTAG_TCK;GPIO1_26}
- {pin_num: '44', pin_signal: GPIO_AD_13, label: 'JTAG_TMS/J55[2]', identifier: JTAG_TMS;GPIO1_27}
- {pin_num: '43', pin_signal: GPIO_AD_14, label: 'ADC12_6/J26[8]', identifier: ADC12_6;CD_26_08}
- {pin_num: '76', pin_signal: GPIO_SD_00, label: 'GPIO_SD_00/BT_CFG[2]', identifier: GPIO_SD_00;GPIO2_00}
- {pin_num: '75', pin_signal: GPIO_SD_01, label: 'GPIO_SD_01/BT_CFG[1]/TP31', identifier: GPIO_SD_01;GPIO2_01}
- {pin_num: '74', pin_signal: GPIO_SD_02, label: GPIO2_02, identifier: GPIO_SD_02;GPIO2_02;GATE_57_02}
- {pin_num: '73', pin_signal: GPIO_SD_03, label: 'GPIO_SD_03/BOOT_MODE[1]', identifier: GPIO_SD_03;GPIO2_03}
- {pin_num: '72', pin_signal: GPIO_SD_04, label: 'GPIO_SD_04/BOOT_MODE[0]', identifier: GPIO_SD_04;GPIO2_04}
- {pin_num: '61', pin_signal: GPIO_SD_13, label: 'GPIO_SD_13/BT_CFG[3]', identifier: GPIO_SD_13;GPIO2_13}
- {pin_num: '62', pin_signal: GPIO_SD_12, label: TP33, identifier: GPIO2_12}
power_domains: {NVCC_GPIO: '3.3'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '1', peripheral: GPIO1, signal: 'gpiomux_io, 11', pin_signal: GPIO_11, identifier: LED_TEST, direction: OUTPUT}
  - {pin_num: '56', peripheral: GPIO1, signal: 'gpiomux_io, 18', pin_signal: GPIO_AD_04, identifier: D5_57_08, direction: OUTPUT}
  - {pin_num: '55', peripheral: GPIO1, signal: 'gpiomux_io, 19', pin_signal: GPIO_AD_05, identifier: D6_57_06, direction: OUTPUT}
  - {pin_num: '12', peripheral: GPIO1, signal: 'gpiomux_io, 01', pin_signal: GPIO_01, identifier: D0_57_18, direction: OUTPUT}
  - {pin_num: '11', peripheral: GPIO1, signal: 'gpiomux_io, 02', pin_signal: GPIO_02, identifier: D1_57_20, direction: OUTPUT}
  - {pin_num: '57', peripheral: GPIO1, signal: 'gpiomux_io, 17', pin_signal: GPIO_AD_03, identifier: D4_57_10, direction: OUTPUT}
  - {pin_num: '58', peripheral: GPIO1, signal: 'gpiomux_io, 16', pin_signal: GPIO_AD_02, identifier: D3_56_16, direction: OUTPUT}
  - {pin_num: '59', peripheral: GPIO1, signal: 'gpiomux_io, 15', pin_signal: GPIO_AD_01, identifier: D2_56_14, direction: OUTPUT}
  - {pin_num: '52', peripheral: GPIO1, signal: 'gpiomux_io, 20', pin_signal: GPIO_AD_06, identifier: D7_57_12, direction: OUTPUT}
  - {pin_num: '51', peripheral: GPIO1, signal: 'gpiomux_io, 21', pin_signal: GPIO_AD_07, identifier: CS_26_2, direction: OUTPUT}
  - {pin_num: '48', peripheral: GPIO1, signal: 'gpiomux_io, 23', pin_signal: GPIO_AD_09, identifier: WR_26_04, direction: OUTPUT}
  - {pin_num: '43', peripheral: GPIO1, signal: 'gpiomux_io, 28', pin_signal: GPIO_AD_14, identifier: CD_26_08, direction: OUTPUT}
  - {pin_num: '2', peripheral: GPIO1, signal: 'gpiomux_io, 10', pin_signal: GPIO_10, identifier: DATA_56_04, direction: INPUT, pull_up_down_config: Pull_Up_100K_Ohm}
  - {pin_num: '74', peripheral: GPIO2, signal: 'gpio_io, 02', pin_signal: GPIO_SD_02, identifier: GATE_57_02, direction: INPUT, pull_up_down_config: Pull_Up_100K_Ohm}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

